# -*- coding: utf-8 -*-
from aiogram import F
from aiogram.fsm.context import FSMContext
from aiogram.types import Message, FSInputFile

from system.dispatcher import router


@router.message(F.text == "Инструкция по использованию")
async def send_instruction(message: Message, state: FSMContext):
    """
    Обработчик команды "Инструкция по использованию".

    Отправляет пользователю Markdown-файл с подробной инструкцией по использованию бота.
    Файл берётся из локальной директории 'doc/'. В случае успеха добавляет ссылку на онлайн-документацию.
    Обрабатывает ошибки, если файл отсутствует или произошла ошибка отправки.

    Args:
        message (Message): Входящее сообщение от пользователя.
        state (FSMContext): Контекст машины состояний, сбрасывается перед отправкой.

    Returns:
        None

    Raises:
        FileNotFoundError: Если файл 'doc/doc.md' не существует.
        Exception: При других ошибках отправки (например, проблемы с сетью).

    Notes:
        - Файл отправляется как документ Telegram.
        - Капшн содержит прямую ссылку на документ в репозитории (gitverse.ru).
    """
    await state.clear()  # Завершаем текущее состояние машины состояния

    try:
        # Отправляем файл напрямую из файловой системы
        await message.answer_document(
            document=FSInputFile("doc/doc.md"),
            caption="📘 <b>Инструкция по использованию</b>\n\n"
                    "Прикреплён подробный руководство по функционалу бота.\n\n"
                    "🔗 <b>Онлайн-документация:</b>\n"
                    "• <a href=\"https://gitverse.ru/pyadminru/AutoParseAlertBot/content/master/doc/doc.md\">GitVerse</a>\n"
                    "• <a href=\"https://github.com/PyRusAdmin/AutoParseAlertBot/blob/master/doc/doc.md\">GitHub</a>\n\n"
                    "Рекомендуем ознакомиться для эффективного использования всех возможностей бота."

    except FileNotFoundError:
        await message.answer("Файл инструкции не найден на сервере.")

    except Exception as e:
        await message.answer(f"Произошла ошибка при отправке файла: {e}")


def register_handlers_post_doc():
    """
    Регистрирует обработчик для отправки инструкции по использованию бота.

    Добавляет в маршрутизатор (router) один обработчик:
        - send_instruction — реагирует на нажатие кнопки "Инструкция по использованию".

    Позволяет пользователю получить актуальную документацию в формате .md-файла
    с описанием всех функций и настроек бота.

    Returns:
        None
    """
    router.message.register(send_instruction)
